GopalSaraf/Practicals/PSDL/include/proc/pic16f17124.h
// Register: PIE6
#define PIE6 PIE6
extern volatile unsigned char           PIE6                __at(0x09C);
#ifndef _LIB_BUILD
asm("PIE6 equ 09Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADIE                   :1;
        unsigned ADTIE                  :1;
        unsigned ZCDIE                  :1;
    };
} PIE6bits_t;
extern volatile PIE6bits_t PIE6bits __at(0x09C);
// bitfield macros
#define _PIE6_ADIE_POSN                                     0x0
#define _PIE6_ADIE_POSITION                                 0x0
#define _PIE6_ADIE_SIZE                                     0x1
#define _PIE6_ADIE_LENGTH                                   0x1
#define _PIE6_ADIE_MASK                                     0x1
#define _PIE6_ADTIE_POSN                                    0x1
#define _PIE6_ADTIE_POSITION                                0x1
#define _PIE6_ADTIE_SIZE                                    0x1
#define _PIE6_ADTIE_LENGTH                                  0x1
#define _PIE6_ADTIE_MASK                                    0x2
#define _PIE6_ZCDIE_POSN                                    0x2
#define _PIE6_ZCDIE_POSITION                                0x2
#define _PIE6_ZCDIE_SIZE                                    0x1
#define _PIE6_ZCDIE_LENGTH                                  0x1
#define _PIE6_ZCDIE_MASK                                    0x4

// Register: PMD0
#define PMD0 PMD0
extern volatile unsigned char           PMD0                __at(0x10C);
#ifndef _LIB_BUILD
asm("PMD0 equ 010Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMMD                  :1;
        unsigned CRCMD                  :1;
        unsigned SCANMD                 :1;
        unsigned SYSCMD                 :1;
        unsigned ACTMD                  :1;
        unsigned IOCMD                  :1;
        unsigned CLKRMD                 :1;
        unsigned TMR0MD                 :1;
    };
} PMD0bits_t;
extern volatile PMD0bits_t PMD0bits __at(0x10C);
// bitfield macros
#define _PMD0_NVMMD_POSN                                    0x0
#define _PMD0_NVMMD_POSITION                                0x0
#define _PMD0_NVMMD_SIZE                                    0x1
#define _PMD0_NVMMD_LENGTH                                  0x1
#define _PMD0_NVMMD_MASK                                    0x1
#define _PMD0_CRCMD_POSN                                    0x1
#define _PMD0_CRCMD_POSITION                                0x1
#define _PMD0_CRCMD_SIZE                                    0x1
#define _PMD0_CRCMD_LENGTH                                  0x1
#define _PMD0_CRCMD_MASK                                    0x2
#define _PMD0_SCANMD_POSN                                   0x2
#define _PMD0_SCANMD_POSITION                               0x2
#define _PMD0_SCANMD_SIZE                                   0x1
#define _PMD0_SCANMD_LENGTH                                 0x1
#define _PMD0_SCANMD_MASK                                   0x4
#define _PMD0_SYSCMD_POSN                                   0x3
#define _PMD0_SYSCMD_POSITION                               0x3
#define _PMD0_SYSCMD_SIZE                                   0x1
#define _PMD0_SYSCMD_LENGTH                                 0x1
#define _PMD0_SYSCMD_MASK                                   0x8
#define _PMD0_ACTMD_POSN                                    0x4
#define _PMD0_ACTMD_POSITION                                0x4
#define _PMD0_ACTMD_SIZE                                    0x1
#define _PMD0_ACTMD_LENGTH                                  0x1
#define _PMD0_ACTMD_MASK                                    0x10
#define _PMD0_IOCMD_POSN                                    0x5
#define _PMD0_IOCMD_POSITION                                0x5
#define _PMD0_IOCMD_SIZE                                    0x1
#define _PMD0_IOCMD_LENGTH                                  0x1
#define _PMD0_IOCMD_MASK                                    0x20
#define _PMD0_CLKRMD_POSN                                   0x6
#define _PMD0_CLKRMD_POSITION                               0x6
#define _PMD0_CLKRMD_SIZE                                   0x1
#define _PMD0_CLKRMD_LENGTH                                 0x1
#define _PMD0_CLKRMD_MASK                                   0x40
#define _PMD0_TMR0MD_POSN                                   0x7
#define _PMD0_TMR0MD_POSITION                               0x7
#define _PMD0_TMR0MD_SIZE                                   0x1
#define _PMD0_TMR0MD_LENGTH                                 0x1
#define _PMD0_TMR0MD_MASK                                   0x80

// Register: PMD1
#define PMD1 PMD1
extern volatile unsigned char           PMD1                __at(0x10D);
#ifndef _LIB_BUILD
asm("PMD1 equ 010Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1MD                 :1;
        unsigned TMR3MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR4MD                 :1;
        unsigned                        :1;
        unsigned CCP1MD                 :1;
        unsigned CCP2MD                 :1;
        unsigned PWM1MD                 :1;
    };
} PMD1bits_t;
extern volatile PMD1bits_t PMD1bits __at(0x10D);
// bitfield macros
#define _PMD1_TMR1MD_POSN                                   0x0
#define _PMD1_TMR1MD_POSITION                               0x0
#define _PMD1_TMR1MD_SIZE                                   0x1
#define _PMD1_TMR1MD_LENGTH                                 0x1
#define _PMD1_TMR1MD_MASK                                   0x1
#define _PMD1_TMR3MD_POSN                                   0x1
#define _PMD1_TMR3MD_POSITION                               0x1
#define _PMD1_TMR3MD_SIZE                                   0x1
#define _PMD1_TMR3MD_LENGTH                                 0x1
#define _PMD1_TMR3MD_MASK                                   0x2
#define _PMD1_TMR2MD_POSN                                   0x2
#define _PMD1_TMR2MD_POSITION                               0x2
#define _PMD1_TMR2MD_SIZE                                   0x1
#define _PMD1_TMR2MD_LENGTH                                 0x1
#define _PMD1_TMR2MD_MASK                                   0x4
#define _PMD1_TMR4MD_POSN                                   0x3
#define _PMD1_TMR4MD_POSITION                               0x3
#define _PMD1_TMR4MD_SIZE                                   0x1
#define _PMD1_TMR4MD_LENGTH                                 0x1
#define _PMD1_TMR4MD_MASK                                   0x8
#define _PMD1_CCP1MD_POSN                                   0x5
#define _PMD1_CCP1MD_POSITION                               0x5
#define _PMD1_CCP1MD_SIZE                                   0x1
#define _PMD1_CCP1MD_LENGTH                                 0x1
#define _PMD1_CCP1MD_MASK                                   0x20
#define _PMD1_CCP2MD_POSN                                   0x6
#define _PMD1_CCP2MD_POSITION                               0x6
#define _PMD1_CCP2MD_SIZE                                   0x1
#define _PMD1_CCP2MD_LENGTH                                 0x1
#define _PMD1_CCP2MD_MASK                                   0x40
#define _PMD1_PWM1MD_POSN                                   0x7
#define _PMD1_PWM1MD_POSITION                               0x7
#define _PMD1_PWM1MD_SIZE                                   0x1
#define _PMD1_PWM1MD_LENGTH                                 0x1
#define _PMD1_PWM1MD_MASK                                   0x80

