GopalSaraf/Practicals/PSDL/include/proc/pic16f17124.h
extern volatile __bit                   G2D1T               __at(0x3499);	// @ (0x693 * 8 + 1)
#define                                 G2D1T_bit           _BIT_ACCESS(CLCnGLS1,1)
// CLCnGLS1<G2D2N>
extern volatile __bit                   G2D2N               __at(0x349A);	// @ (0x693 * 8 + 2)
#define                                 G2D2N_bit           _BIT_ACCESS(CLCnGLS1,2)
// CLCnGLS1<G2D2T>
extern volatile __bit                   G2D2T               __at(0x349B);	// @ (0x693 * 8 + 3)
#define                                 G2D2T_bit           _BIT_ACCESS(CLCnGLS1,3)
// CLCnGLS1<G2D3N>
extern volatile __bit                   G2D3N               __at(0x349C);	// @ (0x693 * 8 + 4)
#define                                 G2D3N_bit           _BIT_ACCESS(CLCnGLS1,4)
// CLCnGLS1<G2D3T>
extern volatile __bit                   G2D3T               __at(0x349D);	// @ (0x693 * 8 + 5)
#define                                 G2D3T_bit           _BIT_ACCESS(CLCnGLS1,5)
// CLCnGLS1<G2D4N>
extern volatile __bit                   G2D4N               __at(0x349E);	// @ (0x693 * 8 + 6)
#define                                 G2D4N_bit           _BIT_ACCESS(CLCnGLS1,6)
// CLCnGLS1<G2D4T>
extern volatile __bit                   G2D4T               __at(0x349F);	// @ (0x693 * 8 + 7)
#define                                 G2D4T_bit           _BIT_ACCESS(CLCnGLS1,7)
// CLCnPOL<G2POL>
extern volatile __bit                   G2POL               __at(0x3469);	// @ (0x68D * 8 + 1)
#define                                 G2POL_bit           _BIT_ACCESS(CLCnPOL,1)
// CLCnGLS2<G3D1N>
extern volatile __bit                   G3D1N               __at(0x34A0);	// @ (0x694 * 8 + 0)
#define                                 G3D1N_bit           _BIT_ACCESS(CLCnGLS2,0)
// CLCnGLS2<G3D1T>
extern volatile __bit                   G3D1T               __at(0x34A1);	// @ (0x694 * 8 + 1)
#define                                 G3D1T_bit           _BIT_ACCESS(CLCnGLS2,1)
// CLCnGLS2<G3D2N>
extern volatile __bit                   G3D2N               __at(0x34A2);	// @ (0x694 * 8 + 2)
#define                                 G3D2N_bit           _BIT_ACCESS(CLCnGLS2,2)
// CLCnGLS2<G3D2T>
extern volatile __bit                   G3D2T               __at(0x34A3);	// @ (0x694 * 8 + 3)
#define                                 G3D2T_bit           _BIT_ACCESS(CLCnGLS2,3)
// CLCnGLS2<G3D3N>
extern volatile __bit                   G3D3N               __at(0x34A4);	// @ (0x694 * 8 + 4)
#define                                 G3D3N_bit           _BIT_ACCESS(CLCnGLS2,4)
// CLCnGLS2<G3D3T>
extern volatile __bit                   G3D3T               __at(0x34A5);	// @ (0x694 * 8 + 5)
#define                                 G3D3T_bit           _BIT_ACCESS(CLCnGLS2,5)
// CLCnGLS2<G3D4N>
extern volatile __bit                   G3D4N               __at(0x34A6);	// @ (0x694 * 8 + 6)
#define                                 G3D4N_bit           _BIT_ACCESS(CLCnGLS2,6)
// CLCnGLS2<G3D4T>
extern volatile __bit                   G3D4T               __at(0x34A7);	// @ (0x694 * 8 + 7)
#define                                 G3D4T_bit           _BIT_ACCESS(CLCnGLS2,7)
// CLCnPOL<G3POL>
extern volatile __bit                   G3POL               __at(0x346A);	// @ (0x68D * 8 + 2)
#define                                 G3POL_bit           _BIT_ACCESS(CLCnPOL,2)
// CLCnGLS3<G4D1N>
extern volatile __bit                   G4D1N               __at(0x34A8);	// @ (0x695 * 8 + 0)
#define                                 G4D1N_bit           _BIT_ACCESS(CLCnGLS3,0)
// CLCnGLS3<G4D1T>
extern volatile __bit                   G4D1T               __at(0x34A9);	// @ (0x695 * 8 + 1)
#define                                 G4D1T_bit           _BIT_ACCESS(CLCnGLS3,1)
// CLCnGLS3<G4D2N>
extern volatile __bit                   G4D2N               __at(0x34AA);	// @ (0x695 * 8 + 2)
#define                                 G4D2N_bit           _BIT_ACCESS(CLCnGLS3,2)
// CLCnGLS3<G4D2T>
extern volatile __bit                   G4D2T               __at(0x34AB);	// @ (0x695 * 8 + 3)
#define                                 G4D2T_bit           _BIT_ACCESS(CLCnGLS3,3)
// CLCnGLS3<G4D3N>
extern volatile __bit                   G4D3N               __at(0x34AC);	// @ (0x695 * 8 + 4)
#define                                 G4D3N_bit           _BIT_ACCESS(CLCnGLS3,4)
// CLCnGLS3<G4D3T>
extern volatile __bit                   G4D3T               __at(0x34AD);	// @ (0x695 * 8 + 5)
#define                                 G4D3T_bit           _BIT_ACCESS(CLCnGLS3,5)
// CLCnGLS3<G4D4N>
extern volatile __bit                   G4D4N               __at(0x34AE);	// @ (0x695 * 8 + 6)
#define                                 G4D4N_bit           _BIT_ACCESS(CLCnGLS3,6)
// CLCnGLS3<G4D4T>
extern volatile __bit                   G4D4T               __at(0x34AF);	// @ (0x695 * 8 + 7)
#define                                 G4D4T_bit           _BIT_ACCESS(CLCnGLS3,7)
// CLCnPOL<G4POL>
extern volatile __bit                   G4POL               __at(0x346B);	// @ (0x68D * 8 + 3)
#define                                 G4POL_bit           _BIT_ACCESS(CLCnPOL,3)
// SSP1CON2<GCEN1>
extern volatile __bit                   GCEN1               __at(0x3C8F);	// @ (0x791 * 8 + 7)
#define                                 GCEN1_bit           _BIT_ACCESS(SSP1CON2,7)
// SSP2CON2<GCEN2>
extern volatile __bit                   GCEN2               __at(0x3CDF);	// @ (0x79B * 8 + 7)
#define                                 GCEN2_bit           _BIT_ACCESS(SSP2CON2,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0xE930);	// @ (0x1D26 * 8 + 0)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,0)
// OPA1CON1<GSEL0>
extern volatile __bit                   GSEL0               __at(0x486C);	// @ (0x90D * 8 + 4)
#define                                 GSEL0_bit           _BIT_ACCESS(OPA1CON1,4)
// OPA1CON1<GSEL1>
extern volatile __bit                   GSEL1               __at(0x486D);	// @ (0x90D * 8 + 5)
#define                                 GSEL1_bit           _BIT_ACCESS(OPA1CON1,5)
// OPA1CON1<GSEL2>
extern volatile __bit                   GSEL2               __at(0x486E);	// @ (0x90D * 8 + 6)
#define                                 GSEL2_bit           _BIT_ACCESS(OPA1CON1,6)
// OSCEN<HFOEN>
extern volatile __bit                   HFOEN               __at(0x148E);	// @ (0x291 * 8 + 6)
#define                                 HFOEN_bit           _BIT_ACCESS(OSCEN,6)
// OSCSTAT<HFOR>
extern volatile __bit                   HFOR                __at(0x1486);	// @ (0x290 * 8 + 6)
#define                                 HFOR_bit            _BIT_ACCESS(OSCSTAT,6)
// OPA1HWC<HWCH0>
extern volatile __bit                   HWCH0               __at(0x4884);	// @ (0x910 * 8 + 4)
#define                                 HWCH0_bit           _BIT_ACCESS(OPA1HWC,4)
// OPA1HWC<HWCH1>
extern volatile __bit                   HWCH1               __at(0x4885);	// @ (0x910 * 8 + 5)
#define                                 HWCH1_bit           _BIT_ACCESS(OPA1HWC,5)
// OPA1HWC<HWCH2>
extern volatile __bit                   HWCH2               __at(0x4886);	// @ (0x910 * 8 + 6)
#define                                 HWCH2_bit           _BIT_ACCESS(OPA1HWC,6)
// OPA1HWC<HWCL0>
extern volatile __bit                   HWCL0               __at(0x4880);	// @ (0x910 * 8 + 0)
#define                                 HWCL0_bit           _BIT_ACCESS(OPA1HWC,0)
// OPA1HWC<HWCL1>
extern volatile __bit                   HWCL1               __at(0x4881);	// @ (0x910 * 8 + 1)
#define                                 HWCL1_bit           _BIT_ACCESS(OPA1HWC,1)
// OPA1HWC<HWCL2>
extern volatile __bit                   HWCL2               __at(0x4882);	// @ (0x910 * 8 + 2)
#define                                 HWCL2_bit           _BIT_ACCESS(OPA1HWC,2)
// SSP1STAT<I2C_DAT1>
extern volatile __bit                   I2C_DAT1            __at(0x3C7D);	// @ (0x78F * 8 + 5)
#define                                 I2C_DAT1_bit        _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<I2C_DAT2>
extern volatile __bit                   I2C_DAT2            __at(0x3CCD);	// @ (0x799 * 8 + 5)
#define                                 I2C_DAT2_bit        _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<I2C_READ1>
extern volatile __bit                   I2C_READ1           __at(0x3C7A);	// @ (0x78F * 8 + 2)
#define                                 I2C_READ1_bit       _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<I2C_READ2>
extern volatile __bit                   I2C_READ2           __at(0x3CCA);	// @ (0x799 * 8 + 2)
#define                                 I2C_READ2_bit       _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<I2C_START1>
extern volatile __bit                   I2C_START1          __at(0x3C7B);	// @ (0x78F * 8 + 3)
#define                                 I2C_START1_bit      _BIT_ACCESS(SSP1STAT,3)
// SSP2STAT<I2C_START2>
extern volatile __bit                   I2C_START2          __at(0x3CCB);	// @ (0x799 * 8 + 3)
#define                                 I2C_START2_bit      _BIT_ACCESS(SSP2STAT,3)
// ADCON0<IC>
extern volatile __bit                   IC                  __at(0xE931);	// @ (0x1D26 * 8 + 1)
#define                                 IC_bit              _BIT_ACCESS(ADCON0,1)
// CPUDOZE<IDLEN>
extern volatile __bit                   IDLEN               __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 IDLEN_bit           _BIT_ACCESS(CPUDOZE,7)
// CWG1CON1<IN>
extern volatile __bit                   IN                  __at(0x308D);	// @ (0x611 * 8 + 5)
#define                                 IN_bit              _BIT_ACCESS(CWG1CON1,5)
// NCO1INCL<INC0>
extern volatile __bit                   INC0                __at(0x2C78);	// @ (0x58F * 8 + 0)
#define                                 INC0_bit            _BIT_ACCESS(NCO1INCL,0)
// NCO1INCL<INC1>
extern volatile __bit                   INC1                __at(0x2C79);	// @ (0x58F * 8 + 1)
#define                                 INC1_bit            _BIT_ACCESS(NCO1INCL,1)
// NCO1INCH<INC10>
extern volatile __bit                   INC10               __at(0x2C82);	// @ (0x590 * 8 + 2)
#define                                 INC10_bit           _BIT_ACCESS(NCO1INCH,2)
// NCO1INCH<INC11>
extern volatile __bit                   INC11               __at(0x2C83);	// @ (0x590 * 8 + 3)
#define                                 INC11_bit           _BIT_ACCESS(NCO1INCH,3)
// NCO1INCH<INC12>
extern volatile __bit                   INC12               __at(0x2C84);	// @ (0x590 * 8 + 4)
#define                                 INC12_bit           _BIT_ACCESS(NCO1INCH,4)
// NCO1INCH<INC13>
extern volatile __bit                   INC13               __at(0x2C85);	// @ (0x590 * 8 + 5)
#define                                 INC13_bit           _BIT_ACCESS(NCO1INCH,5)
// NCO1INCH<INC14>
extern volatile __bit                   INC14               __at(0x2C86);	// @ (0x590 * 8 + 6)
#define                                 INC14_bit           _BIT_ACCESS(NCO1INCH,6)
// NCO1INCH<INC15>
extern volatile __bit                   INC15               __at(0x2C87);	// @ (0x590 * 8 + 7)
#define                                 INC15_bit           _BIT_ACCESS(NCO1INCH,7)
// NCO1INCU<INC16>
extern volatile __bit                   INC16               __at(0x2C88);	// @ (0x591 * 8 + 0)
#define                                 INC16_bit           _BIT_ACCESS(NCO1INCU,0)
// NCO1INCU<INC17>
extern volatile __bit                   INC17               __at(0x2C89);	// @ (0x591 * 8 + 1)
#define                                 INC17_bit           _BIT_ACCESS(NCO1INCU,1)
// NCO1INCU<INC18>
extern volatile __bit                   INC18               __at(0x2C8A);	// @ (0x591 * 8 + 2)
#define                                 INC18_bit           _BIT_ACCESS(NCO1INCU,2)
// NCO1INCU<INC19>
extern volatile __bit                   INC19               __at(0x2C8B);	// @ (0x591 * 8 + 3)
#define                                 INC19_bit           _BIT_ACCESS(NCO1INCU,3)
// NCO1INCL<INC2>
extern volatile __bit                   INC2                __at(0x2C7A);	// @ (0x58F * 8 + 2)
#define                                 INC2_bit            _BIT_ACCESS(NCO1INCL,2)
// NCO1INCL<INC3>
extern volatile __bit                   INC3                __at(0x2C7B);	// @ (0x58F * 8 + 3)
#define                                 INC3_bit            _BIT_ACCESS(NCO1INCL,3)
// NCO1INCL<INC4>
extern volatile __bit                   INC4                __at(0x2C7C);	// @ (0x58F * 8 + 4)
#define                                 INC4_bit            _BIT_ACCESS(NCO1INCL,4)
// NCO1INCL<INC5>
extern volatile __bit                   INC5                __at(0x2C7D);	// @ (0x58F * 8 + 5)
#define                                 INC5_bit            _BIT_ACCESS(NCO1INCL,5)
// NCO1INCL<INC6>
extern volatile __bit                   INC6                __at(0x2C7E);	// @ (0x58F * 8 + 6)
#define                                 INC6_bit            _BIT_ACCESS(NCO1INCL,6)
// NCO1INCL<INC7>
extern volatile __bit                   INC7                __at(0x2C7F);	// @ (0x58F * 8 + 7)
#define                                 INC7_bit            _BIT_ACCESS(NCO1INCL,7)
// NCO1INCH<INC8>
extern volatile __bit                   INC8                __at(0x2C80);	// @ (0x590 * 8 + 0)
#define                                 INC8_bit            _BIT_ACCESS(NCO1INCH,0)
// NCO1INCH<INC9>
extern volatile __bit                   INC9                __at(0x2C81);	// @ (0x590 * 8 + 1)
#define                                 INC9_bit            _BIT_ACCESS(NCO1INCH,1)
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0xF480);	// @ (0x1E90 * 8 + 0)
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0xF481);	// @ (0x1E90 * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0xF482);	// @ (0x1E90 * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0xF483);	// @ (0x1E90 * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0xF484);	// @ (0x1E90 * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0xF485);	// @ (0x1E90 * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLC<INLVLC0>
extern volatile __bit                   INLVLC0             __at(0xF520);	// @ (0x1EA4 * 8 + 0)
#define                                 INLVLC0_bit         _BIT_ACCESS(INLVLC,0)
// INLVLC<INLVLC1>
extern volatile __bit                   INLVLC1             __at(0xF521);	// @ (0x1EA4 * 8 + 1)
#define                                 INLVLC1_bit         _BIT_ACCESS(INLVLC,1)
// INLVLC<INLVLC2>
extern volatile __bit                   INLVLC2             __at(0xF522);	// @ (0x1EA4 * 8 + 2)
#define                                 INLVLC2_bit         _BIT_ACCESS(INLVLC,2)
// INLVLC<INLVLC3>
extern volatile __bit                   INLVLC3             __at(0xF523);	// @ (0x1EA4 * 8 + 3)
#define                                 INLVLC3_bit         _BIT_ACCESS(INLVLC,3)
// INLVLC<INLVLC4>
extern volatile __bit                   INLVLC4             __at(0xF524);	// @ (0x1EA4 * 8 + 4)
#define                                 INLVLC4_bit         _BIT_ACCESS(INLVLC,4)
// INLVLC<INLVLC5>
extern volatile __bit                   INLVLC5             __at(0xF525);	// @ (0x1EA4 * 8 + 5)
#define                                 INLVLC5_bit         _BIT_ACCESS(INLVLC,5)
// PIE0<INTE>
extern volatile __bit                   INTE                __at(0x4B0);	// @ (0x96 * 8 + 0)
#define                                 INTE_bit            _BIT_ACCESS(PIE0,0)
// INTCON<INTEDG>
extern volatile __bit                   INTEDG              __at(0x58);	// @ (0xB * 8 + 0)
#define                                 INTEDG_bit          _BIT_ACCESS(INTCON,0)
// PIR0<INTF>
extern volatile __bit                   INTF                __at(0x460);	// @ (0x8C * 8 + 0)
#define                                 INTF_bit            _BIT_ACCESS(PIR0,0)
// SCANCON0<INTM>
extern volatile __bit                   INTM                __at(0xE4C3);	// @ (0x1C98 * 8 + 3)
#define                                 INTM_bit            _BIT_ACCESS(SCANCON0,3)
// INTPPS<INTPPS0>
extern volatile __bit                   INTPPS0             __at(0xF068);	// @ (0x1E0D * 8 + 0)
#define                                 INTPPS0_bit         _BIT_ACCESS(INTPPS,0)
// INTPPS<INTPPS1>
extern volatile __bit                   INTPPS1             __at(0xF069);	// @ (0x1E0D * 8 + 1)
#define                                 INTPPS1_bit         _BIT_ACCESS(INTPPS,1)
// INTPPS<INTPPS2>
extern volatile __bit                   INTPPS2             __at(0xF06A);	// @ (0x1E0D * 8 + 2)
#define                                 INTPPS2_bit         _BIT_ACCESS(INTPPS,2)
// INTPPS<INTPPS3>
extern volatile __bit                   INTPPS3             __at(0xF06B);	// @ (0x1E0D * 8 + 3)
#define                                 INTPPS3_bit         _BIT_ACCESS(INTPPS,3)
// INTPPS<INTPPS4>
extern volatile __bit                   INTPPS4             __at(0xF06C);	// @ (0x1E0D * 8 + 4)
#define                                 INTPPS4_bit         _BIT_ACCESS(INTPPS,4)
// INTPPS<INTPPS5>
extern volatile __bit                   INTPPS5             __at(0xF06D);	// @ (0x1E0D * 8 + 5)
#define                                 INTPPS5_bit         _BIT_ACCESS(INTPPS,5)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0xF498);	// @ (0x1E93 * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0xF499);	// @ (0x1E93 * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0xF49A);	// @ (0x1E93 * 8 + 2)
#define                                 IOCAF2_bit          _BIT_ACCESS(IOCAF,2)
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0xF49B);	// @ (0x1E93 * 8 + 3)
#define                                 IOCAF3_bit          _BIT_ACCESS(IOCAF,3)
// IOCAF<IOCAF4>
extern volatile __bit                   IOCAF4              __at(0xF49C);	// @ (0x1E93 * 8 + 4)
#define                                 IOCAF4_bit          _BIT_ACCESS(IOCAF,4)
// IOCAF<IOCAF5>
extern volatile __bit                   IOCAF5              __at(0xF49D);	// @ (0x1E93 * 8 + 5)
#define                                 IOCAF5_bit          _BIT_ACCESS(IOCAF,5)
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0xF490);	// @ (0x1E92 * 8 + 0)
#define                                 IOCAN0_bit          _BIT_ACCESS(IOCAN,0)
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0xF491);	// @ (0x1E92 * 8 + 1)
#define                                 IOCAN1_bit          _BIT_ACCESS(IOCAN,1)
// IOCAN<IOCAN2>
extern volatile __bit                   IOCAN2              __at(0xF492);	// @ (0x1E92 * 8 + 2)
#define                                 IOCAN2_bit          _BIT_ACCESS(IOCAN,2)
// IOCAN<IOCAN3>
extern volatile __bit                   IOCAN3              __at(0xF493);	// @ (0x1E92 * 8 + 3)
#define                                 IOCAN3_bit          _BIT_ACCESS(IOCAN,3)
// IOCAN<IOCAN4>
extern volatile __bit                   IOCAN4              __at(0xF494);	// @ (0x1E92 * 8 + 4)
#define                                 IOCAN4_bit          _BIT_ACCESS(IOCAN,4)
// IOCAN<IOCAN5>
extern volatile __bit                   IOCAN5              __at(0xF495);	// @ (0x1E92 * 8 + 5)
#define                                 IOCAN5_bit          _BIT_ACCESS(IOCAN,5)
// IOCAP<IOCAP0>
extern volatile __bit                   IOCAP0              __at(0xF488);	// @ (0x1E91 * 8 + 0)
#define                                 IOCAP0_bit          _BIT_ACCESS(IOCAP,0)
// IOCAP<IOCAP1>
extern volatile __bit                   IOCAP1              __at(0xF489);	// @ (0x1E91 * 8 + 1)
#define                                 IOCAP1_bit          _BIT_ACCESS(IOCAP,1)
// IOCAP<IOCAP2>
extern volatile __bit                   IOCAP2              __at(0xF48A);	// @ (0x1E91 * 8 + 2)
#define                                 IOCAP2_bit          _BIT_ACCESS(IOCAP,2)
// IOCAP<IOCAP3>
extern volatile __bit                   IOCAP3              __at(0xF48B);	// @ (0x1E91 * 8 + 3)
#define                                 IOCAP3_bit          _BIT_ACCESS(IOCAP,3)
// IOCAP<IOCAP4>
extern volatile __bit                   IOCAP4              __at(0xF48C);	// @ (0x1E91 * 8 + 4)
#define                                 IOCAP4_bit          _BIT_ACCESS(IOCAP,4)
// IOCAP<IOCAP5>
extern volatile __bit                   IOCAP5              __at(0xF48D);	// @ (0x1E91 * 8 + 5)
#define                                 IOCAP5_bit          _BIT_ACCESS(IOCAP,5)
// IOCCF<IOCCF0>
extern volatile __bit                   IOCCF0              __at(0xF538);	// @ (0x1EA7 * 8 + 0)
#define                                 IOCCF0_bit          _BIT_ACCESS(IOCCF,0)
// IOCCF<IOCCF1>
extern volatile __bit                   IOCCF1              __at(0xF539);	// @ (0x1EA7 * 8 + 1)
#define                                 IOCCF1_bit          _BIT_ACCESS(IOCCF,1)
// IOCCF<IOCCF2>
extern volatile __bit                   IOCCF2              __at(0xF53A);	// @ (0x1EA7 * 8 + 2)
#define                                 IOCCF2_bit          _BIT_ACCESS(IOCCF,2)
// IOCCF<IOCCF3>
extern volatile __bit                   IOCCF3              __at(0xF53B);	// @ (0x1EA7 * 8 + 3)
#define                                 IOCCF3_bit          _BIT_ACCESS(IOCCF,3)
// IOCCF<IOCCF4>
extern volatile __bit                   IOCCF4              __at(0xF53C);	// @ (0x1EA7 * 8 + 4)
#define                                 IOCCF4_bit          _BIT_ACCESS(IOCCF,4)
// IOCCF<IOCCF5>
extern volatile __bit                   IOCCF5              __at(0xF53D);	// @ (0x1EA7 * 8 + 5)
#define                                 IOCCF5_bit          _BIT_ACCESS(IOCCF,5)
// IOCCN<IOCCN0>
extern volatile __bit                   IOCCN0              __at(0xF530);	// @ (0x1EA6 * 8 + 0)
#define                                 IOCCN0_bit          _BIT_ACCESS(IOCCN,0)
// IOCCN<IOCCN1>
extern volatile __bit                   IOCCN1              __at(0xF531);	// @ (0x1EA6 * 8 + 1)
#define                                 IOCCN1_bit          _BIT_ACCESS(IOCCN,1)
// IOCCN<IOCCN2>
extern volatile __bit                   IOCCN2              __at(0xF532);	// @ (0x1EA6 * 8 + 2)
#define                                 IOCCN2_bit          _BIT_ACCESS(IOCCN,2)
// IOCCN<IOCCN3>
extern volatile __bit                   IOCCN3              __at(0xF533);	// @ (0x1EA6 * 8 + 3)
#define                                 IOCCN3_bit          _BIT_ACCESS(IOCCN,3)
// IOCCN<IOCCN4>
extern volatile __bit                   IOCCN4              __at(0xF534);	// @ (0x1EA6 * 8 + 4)
#define                                 IOCCN4_bit          _BIT_ACCESS(IOCCN,4)
// IOCCN<IOCCN5>
extern volatile __bit                   IOCCN5              __at(0xF535);	// @ (0x1EA6 * 8 + 5)
#define                                 IOCCN5_bit          _BIT_ACCESS(IOCCN,5)
// IOCCP<IOCCP0>
