GopalSaraf/Practicals/PSDL/include/proc/pic16f17124.h
#define                                 NCO1INC2_bit        _BIT_ACCESS(NCO1INCL,2)
// NCO1INCL<NCO1INC3>
extern volatile __bit                   NCO1INC3            __at(0x2C7B);	// @ (0x58F * 8 + 3)
#define                                 NCO1INC3_bit        _BIT_ACCESS(NCO1INCL,3)
// NCO1INCL<NCO1INC4>
extern volatile __bit                   NCO1INC4            __at(0x2C7C);	// @ (0x58F * 8 + 4)
#define                                 NCO1INC4_bit        _BIT_ACCESS(NCO1INCL,4)
// NCO1INCL<NCO1INC5>
extern volatile __bit                   NCO1INC5            __at(0x2C7D);	// @ (0x58F * 8 + 5)
#define                                 NCO1INC5_bit        _BIT_ACCESS(NCO1INCL,5)
// NCO1INCL<NCO1INC6>
extern volatile __bit                   NCO1INC6            __at(0x2C7E);	// @ (0x58F * 8 + 6)
#define                                 NCO1INC6_bit        _BIT_ACCESS(NCO1INCL,6)
// NCO1INCL<NCO1INC7>
extern volatile __bit                   NCO1INC7            __at(0x2C7F);	// @ (0x58F * 8 + 7)
#define                                 NCO1INC7_bit        _BIT_ACCESS(NCO1INCL,7)
// NCO1INCH<NCO1INC8>
extern volatile __bit                   NCO1INC8            __at(0x2C80);	// @ (0x590 * 8 + 0)
#define                                 NCO1INC8_bit        _BIT_ACCESS(NCO1INCH,0)
// NCO1INCH<NCO1INC9>
extern volatile __bit                   NCO1INC9            __at(0x2C81);	// @ (0x590 * 8 + 1)
#define                                 NCO1INC9_bit        _BIT_ACCESS(NCO1INCH,1)
// PMD2<NCO1MD>
extern volatile __bit                   NCO1MD              __at(0x873);	// @ (0x10E * 8 + 3)
#define                                 NCO1MD_bit          _BIT_ACCESS(PMD2,3)
// NCO1CON<NCO1OUT>
extern volatile __bit                   NCO1OUT             __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 NCO1OUT_bit         _BIT_ACCESS(NCO1CON,5)
// NCO1CON<NCO1PFM>
extern volatile __bit                   NCO1PFM             __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 NCO1PFM_bit         _BIT_ACCESS(NCO1CON,0)
// NCO1CON<NCO1POL>
extern volatile __bit                   NCO1POL             __at(0x2C94);	// @ (0x592 * 8 + 4)
#define                                 NCO1POL_bit         _BIT_ACCESS(NCO1CON,4)
// NCO1CLK<NCO1PWS0>
extern volatile __bit                   NCO1PWS0            __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 NCO1PWS0_bit        _BIT_ACCESS(NCO1CLK,5)
// NCO1CLK<NCO1PWS1>
extern volatile __bit                   NCO1PWS1            __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 NCO1PWS1_bit        _BIT_ACCESS(NCO1CLK,6)
// NCO1CLK<NCO1PWS2>
extern volatile __bit                   NCO1PWS2            __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 NCO1PWS2_bit        _BIT_ACCESS(NCO1CLK,7)
// OSCCON1<NDIV0>
extern volatile __bit                   NDIV0               __at(0x1468);	// @ (0x28D * 8 + 0)
#define                                 NDIV0_bit           _BIT_ACCESS(OSCCON1,0)
// OSCCON1<NDIV1>
extern volatile __bit                   NDIV1               __at(0x1469);	// @ (0x28D * 8 + 1)
#define                                 NDIV1_bit           _BIT_ACCESS(OSCCON1,1)
// OSCCON1<NDIV2>
extern volatile __bit                   NDIV2               __at(0x146A);	// @ (0x28D * 8 + 2)
#define                                 NDIV2_bit           _BIT_ACCESS(OSCCON1,2)
// OSCCON1<NDIV3>
extern volatile __bit                   NDIV3               __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 NDIV3_bit           _BIT_ACCESS(OSCCON1,3)
// OSCCON1<NOSC0>
extern volatile __bit                   NOSC0               __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 NOSC0_bit           _BIT_ACCESS(OSCCON1,4)
// OSCCON1<NOSC1>
extern volatile __bit                   NOSC1               __at(0x146D);	// @ (0x28D * 8 + 5)
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON1,5)
// OSCCON1<NOSC2>
extern volatile __bit                   NOSC2               __at(0x146E);	// @ (0x28D * 8 + 6)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON1,6)
// OSCCON3<NOSCR>
extern volatile __bit                   NOSCR               __at(0x147B);	// @ (0x28F * 8 + 3)
#define                                 NOSCR_bit           _BIT_ACCESS(OSCCON3,3)
// OPA1CON1<NSS0>
extern volatile __bit                   NSS0                __at(0x4868);	// @ (0x90D * 8 + 0)
#define                                 NSS0_bit            _BIT_ACCESS(OPA1CON1,0)
// OPA1CON1<NSS1>
extern volatile __bit                   NSS1                __at(0x4869);	// @ (0x90D * 8 + 1)
#define                                 NSS1_bit            _BIT_ACCESS(OPA1CON1,1)
// OPA1CON1<NSS2>
extern volatile __bit                   NSS2                __at(0x486A);	// @ (0x90D * 8 + 2)
#define                                 NSS2_bit            _BIT_ACCESS(OPA1CON1,2)
// NVMADRL<NVMADR0>
extern volatile __bit                   NVMADR0             __at(0xE460);	// @ (0x1C8C * 8 + 0)
#define                                 NVMADR0_bit         _BIT_ACCESS(NVMADRL,0)
// NVMADRL<NVMADR1>
extern volatile __bit                   NVMADR1             __at(0xE461);	// @ (0x1C8C * 8 + 1)
#define                                 NVMADR1_bit         _BIT_ACCESS(NVMADRL,1)
// NVMADRH<NVMADR10>
extern volatile __bit                   NVMADR10            __at(0xE46A);	// @ (0x1C8D * 8 + 2)
#define                                 NVMADR10_bit        _BIT_ACCESS(NVMADRH,2)
// NVMADRH<NVMADR11>
extern volatile __bit                   NVMADR11            __at(0xE46B);	// @ (0x1C8D * 8 + 3)
#define                                 NVMADR11_bit        _BIT_ACCESS(NVMADRH,3)
// NVMADRH<NVMADR12>
extern volatile __bit                   NVMADR12            __at(0xE46C);	// @ (0x1C8D * 8 + 4)
#define                                 NVMADR12_bit        _BIT_ACCESS(NVMADRH,4)
// NVMADRH<NVMADR13>
extern volatile __bit                   NVMADR13            __at(0xE46D);	// @ (0x1C8D * 8 + 5)
#define                                 NVMADR13_bit        _BIT_ACCESS(NVMADRH,5)
// NVMADRH<NVMADR14>
extern volatile __bit                   NVMADR14            __at(0xE46E);	// @ (0x1C8D * 8 + 6)
#define                                 NVMADR14_bit        _BIT_ACCESS(NVMADRH,6)
// NVMADRL<NVMADR2>
extern volatile __bit                   NVMADR2             __at(0xE462);	// @ (0x1C8C * 8 + 2)
#define                                 NVMADR2_bit         _BIT_ACCESS(NVMADRL,2)
// NVMADRL<NVMADR3>
extern volatile __bit                   NVMADR3             __at(0xE463);	// @ (0x1C8C * 8 + 3)
#define                                 NVMADR3_bit         _BIT_ACCESS(NVMADRL,3)
// NVMADRL<NVMADR4>
extern volatile __bit                   NVMADR4             __at(0xE464);	// @ (0x1C8C * 8 + 4)
#define                                 NVMADR4_bit         _BIT_ACCESS(NVMADRL,4)
// NVMADRL<NVMADR5>
extern volatile __bit                   NVMADR5             __at(0xE465);	// @ (0x1C8C * 8 + 5)
#define                                 NVMADR5_bit         _BIT_ACCESS(NVMADRL,5)
// NVMADRL<NVMADR6>
extern volatile __bit                   NVMADR6             __at(0xE466);	// @ (0x1C8C * 8 + 6)
#define                                 NVMADR6_bit         _BIT_ACCESS(NVMADRL,6)
// NVMADRL<NVMADR7>
extern volatile __bit                   NVMADR7             __at(0xE467);	// @ (0x1C8C * 8 + 7)
#define                                 NVMADR7_bit         _BIT_ACCESS(NVMADRL,7)
// NVMADRH<NVMADR8>
extern volatile __bit                   NVMADR8             __at(0xE468);	// @ (0x1C8D * 8 + 0)
#define                                 NVMADR8_bit         _BIT_ACCESS(NVMADRH,0)
// NVMADRH<NVMADR9>
extern volatile __bit                   NVMADR9             __at(0xE469);	// @ (0x1C8D * 8 + 1)
#define                                 NVMADR9_bit         _BIT_ACCESS(NVMADRH,1)
// NVMDATL<NVMDAT0>
extern volatile __bit                   NVMDAT0             __at(0xE470);	// @ (0x1C8E * 8 + 0)
#define                                 NVMDAT0_bit         _BIT_ACCESS(NVMDATL,0)
// NVMDATL<NVMDAT1>
extern volatile __bit                   NVMDAT1             __at(0xE471);	// @ (0x1C8E * 8 + 1)
#define                                 NVMDAT1_bit         _BIT_ACCESS(NVMDATL,1)
// NVMDATH<NVMDAT10>
extern volatile __bit                   NVMDAT10            __at(0xE47A);	// @ (0x1C8F * 8 + 2)
#define                                 NVMDAT10_bit        _BIT_ACCESS(NVMDATH,2)
// NVMDATH<NVMDAT11>
extern volatile __bit                   NVMDAT11            __at(0xE47B);	// @ (0x1C8F * 8 + 3)
#define                                 NVMDAT11_bit        _BIT_ACCESS(NVMDATH,3)
// NVMDATH<NVMDAT12>
extern volatile __bit                   NVMDAT12            __at(0xE47C);	// @ (0x1C8F * 8 + 4)
#define                                 NVMDAT12_bit        _BIT_ACCESS(NVMDATH,4)
// NVMDATH<NVMDAT13>
extern volatile __bit                   NVMDAT13            __at(0xE47D);	// @ (0x1C8F * 8 + 5)
#define                                 NVMDAT13_bit        _BIT_ACCESS(NVMDATH,5)
// NVMDATL<NVMDAT2>
extern volatile __bit                   NVMDAT2             __at(0xE472);	// @ (0x1C8E * 8 + 2)
#define                                 NVMDAT2_bit         _BIT_ACCESS(NVMDATL,2)
// NVMDATL<NVMDAT3>
extern volatile __bit                   NVMDAT3             __at(0xE473);	// @ (0x1C8E * 8 + 3)
#define                                 NVMDAT3_bit         _BIT_ACCESS(NVMDATL,3)
// NVMDATL<NVMDAT4>
extern volatile __bit                   NVMDAT4             __at(0xE474);	// @ (0x1C8E * 8 + 4)
#define                                 NVMDAT4_bit         _BIT_ACCESS(NVMDATL,4)
// NVMDATL<NVMDAT5>
extern volatile __bit                   NVMDAT5             __at(0xE475);	// @ (0x1C8E * 8 + 5)
#define                                 NVMDAT5_bit         _BIT_ACCESS(NVMDATL,5)
// NVMDATL<NVMDAT6>
extern volatile __bit                   NVMDAT6             __at(0xE476);	// @ (0x1C8E * 8 + 6)
#define                                 NVMDAT6_bit         _BIT_ACCESS(NVMDATL,6)
// NVMDATL<NVMDAT7>
extern volatile __bit                   NVMDAT7             __at(0xE477);	// @ (0x1C8E * 8 + 7)
#define                                 NVMDAT7_bit         _BIT_ACCESS(NVMDATL,7)
// NVMDATH<NVMDAT8>
extern volatile __bit                   NVMDAT8             __at(0xE478);	// @ (0x1C8F * 8 + 0)
#define                                 NVMDAT8_bit         _BIT_ACCESS(NVMDATH,0)
// NVMDATH<NVMDAT9>
extern volatile __bit                   NVMDAT9             __at(0xE479);	// @ (0x1C8F * 8 + 1)
#define                                 NVMDAT9_bit         _BIT_ACCESS(NVMDATH,1)
// PIE1<NVMIE>
extern volatile __bit                   NVMIE               __at(0x4B8);	// @ (0x97 * 8 + 0)
#define                                 NVMIE_bit           _BIT_ACCESS(PIE1,0)
// PIR1<NVMIF>
extern volatile __bit                   NVMIF               __at(0x468);	// @ (0x8D * 8 + 0)
#define                                 NVMIF_bit           _BIT_ACCESS(PIR1,0)
// PMD0<NVMMD>
extern volatile __bit                   NVMMD               __at(0x860);	// @ (0x10C * 8 + 0)
#define                                 NVMMD_bit           _BIT_ACCESS(PMD0,0)
// NVMCON1<NVMREGS>
extern volatile __bit                   NVMREGS             __at(0xE486);	// @ (0x1C90 * 8 + 6)
#define                                 NVMREGS_bit         _BIT_ACCESS(NVMCON1,6)
// ODCONA<ODCA0>
extern volatile __bit                   ODCA0               __at(0xF470);	// @ (0x1E8E * 8 + 0)
#define                                 ODCA0_bit           _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCA1>
extern volatile __bit                   ODCA1               __at(0xF471);	// @ (0x1E8E * 8 + 1)
#define                                 ODCA1_bit           _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCA2>
extern volatile __bit                   ODCA2               __at(0xF472);	// @ (0x1E8E * 8 + 2)
#define                                 ODCA2_bit           _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCA4>
extern volatile __bit                   ODCA4               __at(0xF474);	// @ (0x1E8E * 8 + 4)
#define                                 ODCA4_bit           _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCA5>
extern volatile __bit                   ODCA5               __at(0xF475);	// @ (0x1E8E * 8 + 5)
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0xF510);	// @ (0x1EA2 * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0xF511);	// @ (0x1EA2 * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0xF512);	// @ (0x1EA2 * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0xF513);	// @ (0x1EA2 * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0xF514);	// @ (0x1EA2 * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0xF515);	// @ (0x1EA2 * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// DAC1CON<OE0>
extern volatile __bit                   OE0                 __at(0x4464);	// @ (0x88C * 8 + 4)
#define                                 OE0_bit             _BIT_ACCESS(DAC1CON,4)
// DAC1CON<OE1>
extern volatile __bit                   OE1                 __at(0x4465);	// @ (0x88C * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC1CON,5)
// OPA1OFFSET<OFFSET0>
extern volatile __bit                   OFFSET0             __at(0x4888);	// @ (0x911 * 8 + 0)
#define                                 OFFSET0_bit         _BIT_ACCESS(OPA1OFFSET,0)
// OPA1OFFSET<OFFSET1>
extern volatile __bit                   OFFSET1             __at(0x4889);	// @ (0x911 * 8 + 1)
#define                                 OFFSET1_bit         _BIT_ACCESS(OPA1OFFSET,1)
// OPA1OFFSET<OFFSET2>
extern volatile __bit                   OFFSET2             __at(0x488A);	// @ (0x911 * 8 + 2)
#define                                 OFFSET2_bit         _BIT_ACCESS(OPA1OFFSET,2)
// OPA1OFFSET<OFFSET3>
extern volatile __bit                   OFFSET3             __at(0x488B);	// @ (0x911 * 8 + 3)
#define                                 OFFSET3_bit         _BIT_ACCESS(OPA1OFFSET,3)
// OPA1OFFSET<OFFSET4>
extern volatile __bit                   OFFSET4             __at(0x488C);	// @ (0x911 * 8 + 4)
#define                                 OFFSET4_bit         _BIT_ACCESS(OPA1OFFSET,4)
// OPA1OFFSET<OFFSET5>
extern volatile __bit                   OFFSET5             __at(0x488D);	// @ (0x911 * 8 + 5)
#define                                 OFFSET5_bit         _BIT_ACCESS(OPA1OFFSET,5)
// OPA1OFFSET<OFFSET6>
extern volatile __bit                   OFFSET6             __at(0x488E);	// @ (0x911 * 8 + 6)
#define                                 OFFSET6_bit         _BIT_ACCESS(OPA1OFFSET,6)
// OPA1OFFSET<OFFSET7>
extern volatile __bit                   OFFSET7             __at(0x488F);	// @ (0x911 * 8 + 7)
#define                                 OFFSET7_bit         _BIT_ACCESS(OPA1OFFSET,7)
// OPA1CON0<OPA1CPON>
extern volatile __bit                   OPA1CPON            __at(0x4865);	// @ (0x90C * 8 + 5)
#define                                 OPA1CPON_bit        _BIT_ACCESS(OPA1CON0,5)
// OPA1CON0<OPA1EN>
extern volatile __bit                   OPA1EN              __at(0x4867);	// @ (0x90C * 8 + 7)
#define                                 OPA1EN_bit          _BIT_ACCESS(OPA1CON0,7)
// OPA1CON3<OPA1FMS0>
extern volatile __bit                   OPA1FMS0            __at(0x487E);	// @ (0x90F * 8 + 6)
#define                                 OPA1FMS0_bit        _BIT_ACCESS(OPA1CON3,6)
// OPA1CON3<OPA1FMS1>
extern volatile __bit                   OPA1FMS1            __at(0x487F);	// @ (0x90F * 8 + 7)
#define                                 OPA1FMS1_bit        _BIT_ACCESS(OPA1CON3,7)
// OPA1CON1<OPA1GSEL0>
extern volatile __bit                   OPA1GSEL0           __at(0x486C);	// @ (0x90D * 8 + 4)
#define                                 OPA1GSEL0_bit       _BIT_ACCESS(OPA1CON1,4)
// OPA1CON1<OPA1GSEL1>
extern volatile __bit                   OPA1GSEL1           __at(0x486D);	// @ (0x90D * 8 + 5)
#define                                 OPA1GSEL1_bit       _BIT_ACCESS(OPA1CON1,5)
// OPA1CON1<OPA1GSEL2>
extern volatile __bit                   OPA1GSEL2           __at(0x486E);	// @ (0x90D * 8 + 6)
#define                                 OPA1GSEL2_bit       _BIT_ACCESS(OPA1CON1,6)
// OPA1HWC<OPA1HWCH0>
extern volatile __bit                   OPA1HWCH0           __at(0x4884);	// @ (0x910 * 8 + 4)
#define                                 OPA1HWCH0_bit       _BIT_ACCESS(OPA1HWC,4)
// OPA1HWC<OPA1HWCH1>
extern volatile __bit                   OPA1HWCH1           __at(0x4885);	// @ (0x910 * 8 + 5)
#define                                 OPA1HWCH1_bit       _BIT_ACCESS(OPA1HWC,5)
// OPA1HWC<OPA1HWCH2>
extern volatile __bit                   OPA1HWCH2           __at(0x4886);	// @ (0x910 * 8 + 6)
#define                                 OPA1HWCH2_bit       _BIT_ACCESS(OPA1HWC,6)
// OPA1HWC<OPA1HWCL0>
extern volatile __bit                   OPA1HWCL0           __at(0x4880);	// @ (0x910 * 8 + 0)
#define                                 OPA1HWCL0_bit       _BIT_ACCESS(OPA1HWC,0)
// OPA1HWC<OPA1HWCL1>
extern volatile __bit                   OPA1HWCL1           __at(0x4881);	// @ (0x910 * 8 + 1)
#define                                 OPA1HWCL1_bit       _BIT_ACCESS(OPA1HWC,1)
// OPA1HWC<OPA1HWCL2>
extern volatile __bit                   OPA1HWCL2           __at(0x4882);	// @ (0x910 * 8 + 2)
#define                                 OPA1HWCL2_bit       _BIT_ACCESS(OPA1HWC,2)
// PMD4<OPA1MD>
extern volatile __bit                   OPA1MD              __at(0x883);	// @ (0x110 * 8 + 3)
#define                                 OPA1MD_bit          _BIT_ACCESS(PMD4,3)
// OPA1CON2<OPA1NCH0>
extern volatile __bit                   OPA1NCH0            __at(0x4874);	// @ (0x90E * 8 + 4)
#define                                 OPA1NCH0_bit        _BIT_ACCESS(OPA1CON2,4)
// OPA1CON2<OPA1NCH1>
extern volatile __bit                   OPA1NCH1            __at(0x4875);	// @ (0x90E * 8 + 5)
#define                                 OPA1NCH1_bit        _BIT_ACCESS(OPA1CON2,5)
// OPA1CON2<OPA1NCH2>
extern volatile __bit                   OPA1NCH2            __at(0x4876);	// @ (0x90E * 8 + 6)
#define                                 OPA1NCH2_bit        _BIT_ACCESS(OPA1CON2,6)
// OPA1CON1<OPA1NSS0>
extern volatile __bit                   OPA1NSS0            __at(0x4868);	// @ (0x90D * 8 + 0)
#define                                 OPA1NSS0_bit        _BIT_ACCESS(OPA1CON1,0)
// OPA1CON1<OPA1NSS1>
extern volatile __bit                   OPA1NSS1            __at(0x4869);	// @ (0x90D * 8 + 1)
#define                                 OPA1NSS1_bit        _BIT_ACCESS(OPA1CON1,1)
// OPA1CON1<OPA1NSS2>
extern volatile __bit                   OPA1NSS2            __at(0x486A);	// @ (0x90D * 8 + 2)
#define                                 OPA1NSS2_bit        _BIT_ACCESS(OPA1CON1,2)
// OPA1OFFSET<OPA1OFFSET0>
extern volatile __bit                   OPA1OFFSET0         __at(0x4888);	// @ (0x911 * 8 + 0)
#define                                 OPA1OFFSET0_bit     _BIT_ACCESS(OPA1OFFSET,0)
// OPA1OFFSET<OPA1OFFSET1>
extern volatile __bit                   OPA1OFFSET1         __at(0x4889);	// @ (0x911 * 8 + 1)
#define                                 OPA1OFFSET1_bit     _BIT_ACCESS(OPA1OFFSET,1)
// OPA1OFFSET<OPA1OFFSET2>
extern volatile __bit                   OPA1OFFSET2         __at(0x488A);	// @ (0x911 * 8 + 2)
#define                                 OPA1OFFSET2_bit     _BIT_ACCESS(OPA1OFFSET,2)
// OPA1OFFSET<OPA1OFFSET3>
extern volatile __bit                   OPA1OFFSET3         __at(0x488B);	// @ (0x911 * 8 + 3)
#define                                 OPA1OFFSET3_bit     _BIT_ACCESS(OPA1OFFSET,3)
// OPA1OFFSET<OPA1OFFSET4>
extern volatile __bit                   OPA1OFFSET4         __at(0x488C);	// @ (0x911 * 8 + 4)
#define                                 OPA1OFFSET4_bit     _BIT_ACCESS(OPA1OFFSET,4)
// OPA1OFFSET<OPA1OFFSET5>
extern volatile __bit                   OPA1OFFSET5         __at(0x488D);	// @ (0x911 * 8 + 5)
#define                                 OPA1OFFSET5_bit     _BIT_ACCESS(OPA1OFFSET,5)
// OPA1OFFSET<OPA1OFFSET6>
extern volatile __bit                   OPA1OFFSET6         __at(0x488E);	// @ (0x911 * 8 + 6)
#define                                 OPA1OFFSET6_bit     _BIT_ACCESS(OPA1OFFSET,6)
// OPA1OFFSET<OPA1OFFSET7>
extern volatile __bit                   OPA1OFFSET7         __at(0x488F);	// @ (0x911 * 8 + 7)
#define                                 OPA1OFFSET7_bit     _BIT_ACCESS(OPA1OFFSET,7)
// OPA1HWC<OPA1OREN>
extern volatile __bit                   OPA1OREN            __at(0x4887);	// @ (0x910 * 8 + 7)
#define                                 OPA1OREN_bit        _BIT_ACCESS(OPA1HWC,7)
// OPA1HWC<OPA1ORPOL>
extern volatile __bit                   OPA1ORPOL           __at(0x4883);	// @ (0x910 * 8 + 3)
#define                                 OPA1ORPOL_bit       _BIT_ACCESS(OPA1HWC,3)
// OPA1ORS<OPA1ORS0>
extern volatile __bit                   OPA1ORS0            __at(0x4890);	// @ (0x912 * 8 + 0)
#define                                 OPA1ORS0_bit        _BIT_ACCESS(OPA1ORS,0)
// OPA1ORS<OPA1ORS1>
extern volatile __bit                   OPA1ORS1            __at(0x4891);	// @ (0x912 * 8 + 1)
#define                                 OPA1ORS1_bit        _BIT_ACCESS(OPA1ORS,1)
// OPA1ORS<OPA1ORS2>
extern volatile __bit                   OPA1ORS2            __at(0x4892);	// @ (0x912 * 8 + 2)
#define                                 OPA1ORS2_bit        _BIT_ACCESS(OPA1ORS,2)
// OPA1ORS<OPA1ORS3>
extern volatile __bit                   OPA1ORS3            __at(0x4893);	// @ (0x912 * 8 + 3)
#define                                 OPA1ORS3_bit        _BIT_ACCESS(OPA1ORS,3)
// OPA1ORS<OPA1ORS4>
extern volatile __bit                   OPA1ORS4            __at(0x4894);	// @ (0x912 * 8 + 4)
#define                                 OPA1ORS4_bit        _BIT_ACCESS(OPA1ORS,4)
// OPA1CON2<OPA1PCH0>
extern volatile __bit                   OPA1PCH0            __at(0x4870);	// @ (0x90E * 8 + 0)
#define                                 OPA1PCH0_bit        _BIT_ACCESS(OPA1CON2,0)
// OPA1CON2<OPA1PCH1>
extern volatile __bit                   OPA1PCH1            __at(0x4871);	// @ (0x90E * 8 + 1)
#define                                 OPA1PCH1_bit        _BIT_ACCESS(OPA1CON2,1)
// OPA1CON2<OPA1PCH2>
extern volatile __bit                   OPA1PCH2            __at(0x4872);	// @ (0x90E * 8 + 2)
#define                                 OPA1PCH2_bit        _BIT_ACCESS(OPA1CON2,2)
// OPA1CON3<OPA1PSS0>
extern volatile __bit                   OPA1PSS0            __at(0x4878);	// @ (0x90F * 8 + 0)
#define                                 OPA1PSS0_bit        _BIT_ACCESS(OPA1CON3,0)
// OPA1CON3<OPA1PSS1>
extern volatile __bit                   OPA1PSS1            __at(0x4879);	// @ (0x90F * 8 + 1)
#define                                 OPA1PSS1_bit        _BIT_ACCESS(OPA1CON3,1)
// OPA1CON1<OPA1RESON>
extern volatile __bit                   OPA1RESON           __at(0x486B);	// @ (0x90D * 8 + 3)
